Tekla.Structures.Model.BasePoint.CoordinateSystemType
The type of the base points coordinate system.

Tekla.Structures.Model.BasePoint.CoordinateSystemType.GLOBAL
Coordinate system in global.

Tekla.Structures.Model.BasePoint.CoordinateSystemType.WORKPLANE
Coordinate system in work plane.